---
kind: property
id: P:Autodesk.Revit.DB.VertexPair.First
source: html/79a468db-0482-7674-729f-aafb0ab04152.htm
---
# Autodesk.Revit.DB.VertexPair.First Property

Identifies the first index of VertexPair.

## Syntax (C#)
```csharp
public int First { get; set; }
```